AOS.init({
    offset:200,
    duration:800,
    easing: "ease"
});

var arrLang = {
    "ru-gb": {
      "HOME": "Главная",
      "ABOUT": "О нас",
      "Gallery": "Галерея",
      "CONTACT": "Наши контакты",
      "Feature": "О НАС",
      "FeatureText":"Я с удовольствием хочу познакомить вас с нашей компанией, мы - это  Итальянская химчистка «Lavaggio». Я немного расскажу о нашей химчистке.Наша фирма основана в 2004 году.На рынке услуг мы уже 15 лет. Мы работаем на оборудовании известной итальянской фирмы  Firbimatic. В нашей работе используем только итальянскую, чешскую и германскую химию.Обращаясь к нам, каждый клиент уже знает нас как профессионалов своего дела! За эти годы, наша компания зарекомендовала себя как лидер на рынке услуг в сфере химчисток.Основа нашей работы это – качество услуг!Качество услуг во всем!Начиная с приемки вещей и заканчивая выдачей готовых - чистых, проглаженных и упакованных вещей. Мы хотим, чтобы наши клиенты были очень довольны нашей работой и нашей химчисткой.Наша фирма старается помочь клиентам по максимуму.",
      "Slogan":"Химчистка",
      "Meaning": "Химчистка - это процесс стирки одежды без использования воды.",
      "ContactUs": "Позвоните нам",
     
    
    },
    "kz-gb": {
      "HOME": "Уй",
      "ABOUT": "Биздер жайлы",
      "Gallery": "Галереясы",
      "CONTACT": "Контактер",
      "Feature": "Биз жайлы",
      "FeatureText":"Мен сізді біздің компанияға қуанышпен таныстырғым келеді, біз итальяндық «Лаваджо» химиялық тазартқышымыз. Мен сізге химиялық тазалау туралы аздап айтып беремін Біздің компания 2004 жылы құрылған. Біздің қызмет көрсету нарығында 15 жыл болды. Біз әйгілі итальяндық Firbimatic компаниясының жабдықтарында жұмыс істейміз. Біз өз жұмысымызда тек итальяндық, чехтік және неміс химиясын қолданамыз, бізге жүгінетін болсақ, әр клиент бізді өз саласының маманы ретінде біледі! Осы жылдар ішінде біздің компания өзін химиялық тазарту саласындағы қызметтер нарығында көшбасшы ретінде таныта білді.Біздің жұмысымыздың негізі - бұл қызметтердің сапасы! Барлық жағынан қызметтердің сапасы! Заттарды қабылдаудан бастап, дайын - таза, үтіктелген және оралған заттарды жеткізу. Біздің клиенттер біздің жұмысымызға және химиялық тазалауға өте қанағаттанғанын қалаймыз. Біздің компания біздің клиенттерге мүмкіндігінше көмектесуге тырысады",
      "Slogan":"Химиялык тазарту",
      "Meaning": "Химиялық тазалау - бұл суды пайдаланбай киімді тазарту.",
      "ContactUs": "Бізге хабарласыңыз",
      
    
    }
  };
  
  // The default language is Kazakh
  var lang = "kz-gb";
  // Check for localStorage support
  if('localStorage' in window){
     
     var usrLang = localStorage.getItem('uiLang');
     if(usrLang) {
         lang = usrLang
     }
  
  }
  
  
  console.log(lang);
  
          $(document).ready(function() {
  
            $(".lang").each(function(index, element) {
              $(this).text(arrLang[lang][$(this).attr("key")]);
            });
          });
  
          // get/set the selected language
          $(".translate").click(function() {
            var lang = $(this).attr("id");
  
            // update localStorage key
            if('localStorage' in window){
                 localStorage.setItem('uiLang', lang);
                 console.log( localStorage.getItem('uiLang') );
            }
  
            $(".lang").each(function(index, element) {
              $(this).text(arrLang[lang][$(this).attr("key")]);
            });
          });

      

     